## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_ecs_service" "pomerium_sso_proxy" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy/pomerium_sso_proxy"
        name                               = "pomerium_sso_proxy"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:5" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ environment      = [
                        # (1 unchanged element hidden)
                        {
                            name  = "AUTOCERT"
                            value = "FALSE"
                        },
                      + {
                          + name  = "COOKIE_EXPIRE"
                          + value = "8h"
                        },
                        {
                            name  = "IDP_PROVIDER"
                            value = "google"
                        },
                        # (3 unchanged elements hidden)
                    ]
                  - mountPoints      = [] -> null
                    name             = "pomerium_sso_proxy"
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "pomerium_sso_proxy" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
